# 1. У програмі генерується випадкове ціле число від 0 до 100.
# Користувач повинен його відгадати не більше ніж за 10 спроб.
# Після кожної невдалої спроби повинно повідомлятися чи більше чи менше введене користувачем число, ніж те, що загадане.
# Якщо за 10 спроб число не відгадане, то вивести загадане число.

import random

n = random.randint(0, 100)
t = 1
while t <= 10:
    print(f"You have {11-t} shots" if (11-t)>1 else "You have last chanse")
    user_numb = int(input("please, input your number from 0 to 100 - "))
    if user_numb == n:
        print(f"Yes, you WIN!!!")
        break
    else:
        print("Nice try, but you didnt guess. Your number is bigger" if user_numb > n else "Nice try, but you didnt guess. Your number is smaller")
    t += 1

print(f"Random number was - {n}" if t > 10 else "It was great")

# 2. Вводяться десять натуральних чисел більше 2. Порахувати, скільки серед них чисел, що кратні 5-ти. (не використовувати лісти)

# 3. Вивести на екран таблицю множення (від 1 до 9).

# 4. Вивести на екран «прямокутник» розміру N на M, утворений з двох видів символів. Контур прямокутника повинен складатися з одного символу, а "заливка" - з іншого.

# 5. Дано число P  і число H. Користувач вводить послідовність чисел. Визначити: суму тих чисел, які менше P; добуток чисел, які більші за H; кількість чисел, що знаходяться  в діапазоні значень від P до H. При введенні числа рівного P або H, припинити обчислення та вивести результат. (не використовувати білдін функції)

# 6. Для чисел, що вводяться користувачем, визначити відсоток додатних та від’ємних чисел. При введенні числа 0 закінчити роботу.